cases/steady/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

kappa                0.42;
Cmu                  0.09;
flowDir              (1 0 0);
zDir                 (0 0 1);
Uref                 5.4885;
Zref                 1;

z0                   uniform 0.00059;
d                    uniform 0;



// ************************************************************************* //
