cases/steady/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType          RAS;

RAS
{
    RASModel            kEpsilon;
    turbulence          on;
    printCoeffs         on;
/*
    RAS_MODELCoeffs     // Valid only for epsilon-based models
    {
        Cmu         0.09;
        C1          1.44;
        C2          1.92;
        sigmaEps    1.11; //Original value:1.44
        // See p. 358:
        //  Hargreaves, D. M., & Wright, N. G. (2007).
        //  On the use of the k–ε model in commercial CFD software
        //  to model the neutral atmospheric boundary layer.
        //  Journal of wind engineering and
        //  industrial aerodynamics, 95(5), 355-369.
        //  DOI:10.1016/j.jweia.2006.08.002
    }
*/
}


// ************************************************************************* //
